let { fancy } = require('../../lib/scraper')

module.exports = {
   name: 'fancy',
   category: 'converter',
   desc: 'Makes stylish/fancy given text.',
   use: '5 SamPandey001',
   async exec(citel, Void,args) {
    if(!args[0]) return citel.reply(`
0. Ⓣⓗⓘⓢ ⓘⓢ Ⓢⓔⓒⓚⓣⓞⓡ
1. 🅣🅗🅘🅢 🅘🅢 🅢🅔🅒🅚🅣🅞🅡
2. Ｔｈｉｓ ｉｓ Ｓｅｃｋｔｏｒ
3. 𝐓𝐡𝐢𝐬 𝐢𝐬 𝐒𝐞𝐜𝐤𝐭𝐨𝐫
4. 𝕿𝖍𝖎𝖘 𝖎𝖘 𝕾𝖊𝖈𝖐𝖙𝖔𝖗
5. 𝑻𝒉𝒊𝒔 𝒊𝒔 𝑺𝒆𝒄𝒌𝒕𝒐𝒓
6. 𝓣𝓱𝓲𝓼 𝓲𝓼 𝓢𝓮𝓬𝓴𝓽𝓸𝓻
7. 𝕋𝕙𝕚𝕤 𝕚𝕤 𝕊𝕖𝕔𝕜𝕥𝕠𝕣
8. 𝚃𝚑𝚒𝚜 𝚒𝚜 𝚂𝚎𝚌𝚔𝚝𝚘𝚛
9. 𝖳𝗁𝗂𝗌 𝗂𝗌 𝖲𝖾𝖼𝗄𝗍𝗈𝗋
10. 𝗧𝗵𝗶𝘀 𝗶𝘀 𝗦𝗲𝗰𝗸𝘁𝗼𝗿
11. 𝙏𝙝𝙞𝙨 𝙞𝙨 𝙎𝙚𝙘𝙠𝙩𝙤𝙧
12. 𝘛𝘩𝘪𝘴 𝘪𝘴 𝘚𝘦𝘤𝘬𝘵𝘰𝘳
13. ⒯⒣⒤⒮ ⒤⒮ ⒮⒠⒞⒦⒯⒪⒭
14. 🇹🇭🇮🇸 🇮🇸 🇸🇪🇨🇰🇹🇴🇷
15. 🅃🄷🄸🅂 🄸🅂 🅂🄴🄲🄺🅃🄾🅁
16. 🆃🅷🅸🆂 🅸🆂 🆂🅴🅲🅺🆃
17. Thíś íś śéćḱtőŕ
18. んﾉ丂 ﾉ丂 丂乇cズｲo尺
19. Շɦٱร ٱร รﻉƈᛕՇѻɼ
20. тнιѕ ιѕ ѕє¢ктσя
21. Շђเร เร รєςкՇ๏г
22. ГЂіѕ іѕ Ѕэсктоѓ
23. ፕዘጎነ ጎነ ነቿርጕፕዐዪ
24. 𝔗𝔥𝔦𝔰 𝔦𝔰 𝔖𝔢𝔠𝔨𝔱𝔬𝔯
25. Ṫḧïṡ ïṡ Ṡëċḳẗöṛ
26. ᴛʜɪꜱ ɪꜱ ꜱᴇᴄᴋᴛᴏʀ
27. Ŧħɨs ɨs Sɇȼꝁŧøɍ
28. ₜₕᵢₛ ᵢₛ ₛₑcₖₜₒᵣ
29. ᵀʰⁱˢ ⁱˢ ˢᵉᶜᵏᵗᵒʳ
30. ꓕɥıs ıs Sǝɔʞʇoɹ
31. ɹoʇʞɔǝS sı sıɥꓕ
32. THiꙅ iꙅ ꙄɘↄkToᴙ0T33.
33. ᴙoTkↄɘꙄ ꙅi ꙅiHT
`)
	  let fancytext = await fancy(`${args.join(" ").slice(2)}`, args[0])
			citel.reply(fancytext)

   }
}
